In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series, DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [6]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6

In [10]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [17]:
sdata = {'Florença': 3500, 'Toscana': 71000, 'Milão': 16000, 'Roma': 5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

Florença     3500
Toscana     71000
Milão       16000
Roma         5000
dtype: int64

In [20]:
states = ['Toscana','Florença','Milão','Roma']

In [21]:
obj4 = pd.Series(sdata, index=states)

In [22]:
obj4

Toscana     71000
Florença     3500
Milão       16000
Roma         5000
dtype: int64

In [23]:
pd.isnull(obj4)

Toscana     False
Florença    False
Milão       False
Roma        False
dtype: bool

In [24]:
pd.notnull(obj4)

Toscana     True
Florença    True
Milão       True
Roma        True
dtype: bool

In [25]:
obj4.isnull()

Toscana     False
Florença    False
Milão       False
Roma        False
dtype: bool

In [26]:
obj3

Florença     3500
Toscana     71000
Milão       16000
Roma         5000
dtype: int64

In [27]:
obj4

Toscana     71000
Florença     3500
Milão       16000
Roma         5000
dtype: int64

In [28]:
obj3 + obj4

Florença      7000
Milão        32000
Roma         10000
Toscana     142000
dtype: int64

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
Toscana     71000
Florença     3500
Milão       16000
Roma         5000
Name: population, dtype: int64

In [32]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [33]:
obj.index = ['Nick','Malik','Kletus','Trask']

In [34]:
obj

Nick      4
Malik     7
Kletus   -5
Trask     3
dtype: int64

In [35]:
data = {'state': ['San Fierro', 'San Fierro', 'San Fierro', 'Las Venturas', 'Las Venturas', 'Las Venturas'],
               'year': [2000,2001,2002,2001,2001,2003],
               'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [36]:
frame

          state  year  pop
0    San Fierro  2000  1.5
1    San Fierro  2001  1.7
2    San Fierro  2002  3.6
3  Las Venturas  2001  2.4
4  Las Venturas  2001  2.9
5  Las Venturas  2003  3.2

In [37]:
frame.head()

          state  year  pop
0    San Fierro  2000  1.5
1    San Fierro  2001  1.7
2    San Fierro  2002  3.6
3  Las Venturas  2001  2.4
4  Las Venturas  2001  2.9

In [38]:
pd.DataFrame(data, columns=['year','state','pop'])

   year         state  pop
0  2000    San Fierro  1.5
1  2001    San Fierro  1.7
2  2002    San Fierro  3.6
3  2001  Las Venturas  2.4
4  2001  Las Venturas  2.9
5  2003  Las Venturas  3.2

In [40]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                     ......:index=['one','two','three','four','five','six'])

In [41]:
frame2

       year         state  pop debt
one    2000    San Fierro  1.5  NaN
two    2001    San Fierro  1.7  NaN
three  2002    San Fierro  3.6  NaN
four   2001  Las Venturas  2.4  NaN
five   2001  Las Venturas  2.9  NaN
six    2003  Las Venturas  3.2  NaN

In [42]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
frame2['state']

one        San Fierro
two        San Fierro
three      San Fierro
four     Las Venturas
five     Las Venturas
six      Las Venturas
Name: state, dtype: object

In [44]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2001
six      2003
Name: year, dtype: int64

In [45]:
frame2.loc['three']

year           2002
state    San Fierro
pop             3.6
debt            NaN
Name: three, dtype: object

In [46]:
frame2['debt'] = 16.5

In [47]:
frame2

       year         state  pop  debt
one    2000    San Fierro  1.5  16.5
two    2001    San Fierro  1.7  16.5
three  2002    San Fierro  3.6  16.5
four   2001  Las Venturas  2.4  16.5
five   2001  Las Venturas  2.9  16.5
six    2003  Las Venturas  3.2  16.5

In [48]:
frame2['debt'] = np.arange(6.)

In [49]:
frame2

       year         state  pop  debt
one    2000    San Fierro  1.5   0.0
two    2001    San Fierro  1.7   1.0
three  2002    San Fierro  3.6   2.0
four   2001  Las Venturas  2.4   3.0
five   2001  Las Venturas  2.9   4.0
six    2003  Las Venturas  3.2   5.0

In [50]:
val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [51]:
frame2['debt'] = val

In [52]:
frame2

       year         state  pop  debt
one    2000    San Fierro  1.5   NaN
two    2001    San Fierro  1.7  -1.2
three  2002    San Fierro  3.6   NaN
four   2001  Las Venturas  2.4  -1.5
five   2001  Las Venturas  2.9  -1.7
six    2003  Las Venturas  3.2   NaN

In [53]:
frame2['eastern'] = frame2.state == 'San Fierro'

In [54]:
frame2

       year         state  pop  debt  eastern
one    2000    San Fierro  1.5   NaN     True
two    2001    San Fierro  1.7  -1.2     True
three  2002    San Fierro  3.6   NaN     True
four   2001  Las Venturas  2.4  -1.5    False
five   2001  Las Venturas  2.9  -1.7    False
six    2003  Las Venturas  3.2   NaN    False

In [55]:
del frame2['eastern']

In [56]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [57]:
pop = {'San Fierro': {2001: 2.4, 2002:2.9},
      ......:'Las Ventura': {2000: 1.5, 2001:1.7}, 2002:3.6}

In [58]:
frame3 = pd.DataFrame(pop)

In [59]:
frame3

      San Fierro  Las Ventura  2002
2001         2.4          1.7   3.6
2002         2.9          NaN   3.6
2000         NaN          1.5   3.6

In [60]:
frame3.T

             2001  2002  2000
San Fierro    2.4   2.9   NaN
Las Ventura   1.7   NaN   1.5
2002          3.6   3.6   3.6

In [61]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      San Fierro  Las Ventura  2002
2001         2.4          1.7   3.6
2002         2.9          NaN   3.6
2003         NaN          NaN   3.6

In [62]:
pdata = {'Las Venturas': frame3['Las Ventura'][:-1],
        ......:'San Fierro': frame3['Las Ventura'][:2]}

In [63]:
pd.DataFrame(pdata)

      Las Venturas  San Fierro
2001           1.7         1.7
2002           NaN         NaN

In [64]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [65]:
frame3

state  San Fierro  Las Ventura  2002
year
2001          2.4          1.7   3.6
2002          2.9          NaN   3.6
2000          NaN          1.5   3.6

In [66]:
frame3.values

array([[2.4, 1.7, 3.6],
       [2.9, nan, 3.6],
       [nan, 1.5, 3.6]])

In [67]:
frame2.values

array([[2000, 'San Fierro', 1.5, nan],
       [2001, 'San Fierro', 1.7, -1.2],
       [2002, 'San Fierro', 3.6, nan],
       [2001, 'Las Venturas', 2.4, -1.5],
       [2001, 'Las Venturas', 2.9, -1.7],
       [2003, 'Las Venturas', 3.2, nan]], dtype=object)

In [68]:
obj = pd.Series(range(3), index=['a','b','c'])

In [69]:
index = obj.index

In [70]:
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[1:]

Index(['b', 'c'], dtype='object')

In [73]:
labels = pd.Index(np.arange(3))

In [74]:
labels

Index([0, 1, 2], dtype='int64')

In [75]:
obj2 = pd.Series([1.5,-2.5,0], index=labels)

In [76]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [77]:
obj2.index is labels

True

In [78]:
frame3

state  San Fierro  Las Ventura  2002
year
2001          2.4          1.7   3.6
2002          2.9          NaN   3.6
2000          NaN          1.5   3.6

In [79]:
frame3.columns

Index(['San Fierro', 'Las Ventura', 2002], dtype='object', name='state')

In [81]:
2005 in frame3.index

False

In [82]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [83]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [84]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [85]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [86]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [87]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [88]:
obj3 = pd.Series(['green','purple','black'], index=[0,2,4])

In [89]:
obj3

0     green
2    purple
4     black
dtype: object

In [90]:
obj3.reindex(range(6), method='ffill')

0     green
1     green
2    purple
3    purple
4     black
5     black
dtype: object

In [93]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     ......:index=['a','c','d'],
                     ......:columns=['Liberty City', 'Los Santos', 'San Fierro'])

In [94]:
frame

   Liberty City  Los Santos  San Fierro
a             0           1           2
c             3           4           5
d             6           7           8

In [95]:
frame2 = frame.reindex(['a','b','c','d'])

In [96]:
frame2

   Liberty City  Los Santos  San Fierro
a           0.0         1.0         2.0
b           NaN         NaN         NaN
c           3.0         4.0         5.0
d           6.0         7.0         8.0

In [97]:
states = ['Liberty City', 'Los Santos', 'San Fierro']

In [98]:
frame.reindex(columns=states)

   Liberty City  Los Santos  San Fierro
a             0           1           2
c             3           4           5
d             6           7           8

In [105]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])

In [106]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [107]:
new_obj = obj.drop('c')

In [108]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [110]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   ......:index=['Roma','Milão','Florença','Toscana'],
                   ......:columns=['one','two','three','four'])

In [111]:
data

          one  two  three  four
Roma        0    1      2     3
Milão       4    5      6     7
Florença    8    9     10    11
Toscana    12   13     14    15

In [112]:
data.drop(['Roma','Florença'])

         one  two  three  four
Milão      4    5      6     7
Toscana   12   13     14    15

In [113]:
data.drop('two', axis=1)

          one  three  four
Roma        0      2     3
Milão       4      6     7
Florença    8     10    11
Toscana    12     14    15

In [115]:
data.drop(['two','four'], axis='columns')

          one  three
Roma        0      2
Milão       4      6
Florença    8     10
Toscana    12     14

In [116]:
obj.drop('c', inplace=True)

In [117]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [118]:
obj[[1,3]]

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_1606/1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
e    4.0
dtype: float64

In [119]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [120]:
obj['b':'c']

b    1.0
dtype: float64

In [121]:
obj['b':'v'] = 5

In [122]:
obj

a    0.0
b    5.0
d    5.0
e    5.0
dtype: float64

In [124]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   ......:index=['Los Santos','San Fierro','Las Ventura','Liberty City'],
                   ......:columns=['one','two','three','four'])

In [125]:
data

              one  two  three  four
Los Santos      0    1      2     3
San Fierro      4    5      6     7
Las Ventura     8    9     10    11
Liberty City   12   13     14    15

In [126]:
data < 5

                one    two  three   four
Los Santos     True   True   True   True
San Fierro     True  False  False  False
Las Ventura   False  False  False  False
Liberty City  False  False  False  False

In [127]:
data[data < 5] = 0

In [128]:
data

              one  two  three  four
Los Santos      0    0      0     0
San Fierro      0    5      6     7
Las Ventura     8    9     10    11
Liberty City   12   13     14    15

In [129]:
data.loc['Los Santos',['two', 'three']]

two      0
three    0
Name: Los Santos, dtype: int64

In [131]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Las Ventura, dtype: int64

In [132]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Las Ventura, dtype: int64

In [133]:
data.iloc[[1,2], [3,0,1]]

             four  one  two
San Fierro      7    0    5
Las Ventura    11    8    9

In [134]:
data.loc[:'San Fierro', 'two']

Los Santos    0
San Fierro    5
Name: two, dtype: int64

In [135]:
data.iloc[:,:3][data.three > 5]

              one  two  three
San Fierro      0    5      6
Las Ventura     8    9     10
Liberty City   12   13     14

In [137]:
ser = pd.Series(np.arange(3.))

In [138]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [139]:
ser2 = pd.Series(np.arange(3.), index=['a','b','c'])

In [140]:
ser2[-1]

/run/user/1000/app/org.jupyter.JupyterLab/ipykernel_1606/811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [141]:
ser[:1]

0    0.0
dtype: float64

In [142]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [143]:
ser.iloc[:1]

0    0.0
dtype: float64

In [144]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [145]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],
              ......:index=['a','c','c','f','g'])

In [146]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [147]:
s2

a   -2.1
c    3.6
c   -1.5
f    4.0
g    3.1
dtype: float64

In [148]:
s1 + s2

a    5.2
c    1.1
c   -4.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [149]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                  ......:index=['Toscana','Roma','Milão'])

In [150]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                  ......:index=['Florença','Lazio','Florença','Milão'])

In [151]:
df1

           b    c    d
Toscana  0.0  1.0  2.0
Roma     3.0  4.0  5.0
Milão    6.0  7.0  8.0

In [152]:
df2

            b     d     e
Florença  0.0   1.0   2.0
Lazio     3.0   4.0   5.0
Florença  6.0   7.0   8.0
Milão     9.0  10.0  11.0

In [153]:
df1 + df2

             b   c     d   e
Florença   NaN NaN   NaN NaN
Florença   NaN NaN   NaN NaN
Lazio      NaN NaN   NaN NaN
Milão     15.0 NaN  18.0 NaN
Roma       NaN NaN   NaN NaN
Toscana    NaN NaN   NaN NaN

In [154]:
df1 = pd.DataFrame({'A':[1,2]})

In [155]:
df2 = pd.DataFrame({'B':[3,4]})

In [156]:
df1

   A
0  1
1  2

In [157]:
df2

   B
0  3
1  4

In [158]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN